Revit 2027 API
DeleteWorksetSettings Constructor
Overload List
Name | Description
DeleteWorksetSettings() |  Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.
DeleteWorksetSettings(DeleteWorksetOption, WorksetId) |  Constructs a DeleteWorksetSettings object.
Top
See Also
Reference
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace